TCP 是传输层中重要的一项协议，也是我们常用的进程间通信方式，因此掌握 C++ 中的 TCP 套接字网络编程十分重要
传输层是我们在编程开发中较为重要的一层，需要对其中的两种协议尤其是 TCP 理解透彻。
传输层的根本目的是在网络层提供的数据通信服务基础上，实现主机的进程间通信的可靠服务。
提供通信服务、提供可靠的通信服务。
套接字： ip:port
端口号：1-1023 熟知端口号  给每种服务器分配确定的全局端口号比如53，67，68
注册端口号： 1024- 49151  在IANA注册的端口号
临时端口号： 49152-65535
平时服务器使用注册端口号，客户端使用临时端口号

------------>  SYN
<------------   ACK+SYN
------------>   ACK

为什么要第三次握手----- 防止B 资源的浪费
    
TCP 网络编程 （ C/S架构 ）进程间通信，进程以套接字方式表示，所以socket要绑定套接字。客户端自动分配port,所以不用bind()

Server: 创建:socket(),绑定:bind(),监听:listen(), 取出链接成功的socket:accept(),接受/发送数据:recv/send()

Client: 创建:socket(),请求链接:connect(), 接受/发送数据: recv/send()